/*

여러줄의 주석을 입력하는 영역
클래스와 파일이름 이름짓기(명령규칙)
무조건 첫글자는 대문자

가급적 2개 이상의 단어를 조합하여 이름을 짓자
사전(DIC)에 있는 단어들을 1개만 사용할 경우 
JAVA에 기본적으로 있는 Key Word와 겹쳐서
문제를 일으키기도 한다.
그러한 문제를 피하기 위해 사저나에 있는 단어를 
사용하고자 하면 2개 이상의 단어를 조합하는 것이 좋다.

단어 2개 이상을 조합하여 사용할 경우
첫글자는 무조건 대문자 이후 시작되는 단어 첫글자도 대문자로 사용하자.
=> 이렇게 이름 짓는 법을 Camel Case 명명법 이라고 한다.
또는 중간에 _를 넣어 사용해도 된다. Ex) Nation_korea
=> 이렇게 이름 짓는 법을 Snake Case 명명법 이라고 한다.
* 단어 빈칸에 빈칸 or 특수문자 사용 금지
Nation1, Nation_1 : 숫자등을 조합하여 사용가능 But 첫글자가 숫자가 올 순 없다.



*/

public class NationKorea {


}